areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_pps-d.h
/* Microchip Technology Inc. and its subsidiaries.  You may use this software
 * and any derivatives exclusively with Microchip products.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER
 * EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED
 * WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
 * PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION
 * WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE,
 * INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND
 * WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS
 * BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE
 * FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS
 * IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF
 * ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE
 * TERMS.
 */

/**
 * @file    p33c_pps-d.h
 * @see     p33c_pps.h
 * @author  M91406
 * @brief   Peripheral Pin Select (PPS) register abstraction data type declarations
 * @details
 *  This additional header file contains defines for all required bit-settings of all related
 *  special function registers of a peripheral module and/or instance.
 *  This file is an additional header file on top of the generic device header file.
 */

// This is a guard condition so that contents of this file are not included
// more than once.
#ifndef P33C_PPS_SFR_DECLARATIONS_H
#define P33C_PPS_SFR_DECLARATIONS_H

#include <xc.h> // include processor files - each processor file is guarded.
#include <stdint.h> // include standard integer types header file
#include <stdbool.h> // include standard boolean types header file
#include "p33c_devices.h" // include dsPIC33 device identification header file

/*********************************************************************************
 * @ingroup p33c-pral-pps-constants-constants
 * @brief   Start index of RP device pins
 **********************************************************************************/
#define RP_PINNO_MIN		32U ///< Start index of remappable device pins (RPx)

/*********************************************************************************
 * @ingroup p33c-pral-pps-constants-constants
 * @brief   End index of RP device pins.
 * @note    The value of this macro may change with the selected device type and pin-count.
 **********************************************************************************/
#define RP_PINNO_MAX        71U ///< End index of remappable device pins (RPx)

#if defined (__P33SMPS_ARA__)
  #undef  RP_PINNO_MAX
  #define RP_PINNO_MAX 77U ///< End index of remappable device pins (RPx)
#elif  defined (__P33SMPS_SAGITTA__)
  #undef  RP_PINNO_MAX
  #define RP_PINNO_MAX 79U ///< End index of remappable device pins (RPx)
#elif  defined (__P33SMPS_SAGITTAP__)
  #undef  RP_PINNO_MAX
  #define RP_PINNO_MAX 79U ///< End index of remappable device pins (RPx)
#elif  defined (__P33SMPS_SAGITTAPP__)
  #undef  RP_PINNO_MAX
  #define RP_PINNO_MAX 99U ///< End index of remappable device pins (RPx)
#elif  defined (__P33SMPS_OCTANSP__)
  #undef  RP_PINNO_MAX
  #define RP_PINNO_MAX 71U ///< End index of remappable device pins (RPx)
#elif  defined (__P33SMPS_GEMINI__)
  #undef  RP_PINNO_MAX
  #define RP_PINNO_MAX 71U ///< End index of remappable device pins (RPx)
#elif  defined (__P33SMPS_SAGITTARIUS__)
  #undef  RP_PINNO_MAX
  #define RP_PINNO_MAX 71U ///< End index of remappable device pins (RPx)
#else
  #pragma message "-- error: selected device not supported by peripheral pin select register abstraction module"
#endif

/*********************************************************************************
 * @ingroup p33c-pral-pps-constants-constants
 * @brief   Start index of virtual RP device pins
 **********************************************************************************/
#define RPV_PINNO_MIN	176U ///< Start index of vitual remappable device pins (VRPx)

#define PPS_RPVxR(x)    (uint8_t*)(((uint16_t)&RPOR24)+x)
#define PPS_RPV0R       (uint8_t*)&RPOR24
#define PPS_RPV1R       (uint8_t*)&RPOR24+1
#define PPS_RPV2R       (uint8_t*)&RPOR25
#define PPS_RPV3R       (uint8_t*)&RPOR25+1
#define PPS_RPV4R       (uint8_t*)&RPOR25
#define PPS_RPV5R       (uint8_t*)&RPOR25+1

#define PPS_RPV(x)      (uint8_t)(RPV_PINNO_MIN + x)
#define PPS_RPV0        (uint8_t)176
#define PPS_RPV1        (uint8_t)177
#define PPS_RPV2        (uint8_t)178
#define PPS_RPV3        (uint8_t)179
#define PPS_RPV4        (uint8_t)180
#define PPS_RPV5        (uint8_t)181

/*********************************************************************************
 * @ingroup p33c-pral-pps-constants-constants
 * @brief   End index of virtual RP device pins
 **********************************************************************************/
#define RPV_PINNO_MAX	181U ///< End index of vitual remappable device pins (VRPx)

/*********************************************************************************
 * @addtogroup p33c-pral-pps-constants-input
 * @{
 * @details
 * Peripheral Pin Select Input Sources specify the peripheral function
 * mapped to a specific device input pin. Each available input source
 * has its own input register location to which the desired RP number
 * of the device pin must be written to. The listed macros can be used
 * to write the RP pin number to the PPS Input Source register.
 *
 * <p><b>Example</b></p>
 *  Device pin RC2 should be assigned as UART1 Receive input.
 *  The input source register location of the UART1 Receive
 *  input configuration is the low-byte of register RPINR18.
 *  The device RP number of port pin RC2 is RP50.
 *
 * <b><u>Example 1</u></b>
 *  shows the direct register access method, where the device
 *  RP pin index is directly written to the RPINRx register of
 *  the desired peripheral function:
 *
 * @code {.c}
 *
 *  *PPSI_U1RX = 50; // Assign pin RP50 to UART1 RX (Example 1)
 *
 * @endcode
 *
 * <b><u>Example 2</u></b>
 *  shows the usage of the p33c_pps API function, where the
 *  device RP pin index is written to the RPINRx register of
 *  the desired peripheral function by calling function
 *  p33c_PPS_MapInput(x, y):
 *
 * @code {.c}
 *
 *  p33c_PPS_MapInput(50, PPSI_U1RX); // Assign pin RP50 to UART1 RX (Example 2)
 *
 * @endcode
 *
 * @note
 * Not all peripheral functions are available on all devices, and the list
 * captured in this documentation may not be complete. Please review
 * the target device data sheet as well as the header file code directly
 * for more information.
 *
 * @see
 *  p33c_pps.h
 **********************************************************************************/

#define PPSI_INT1       (uint8_t*)&RPINR0+1  ///< External Interrupt 1
#define PPSI_INT2	    (uint8_t*)&RPINR1    ///< External Interrupt 2
#define PPSI_INT3	    (uint8_t*)&RPINR1+1  ///< External Interrupt 3
#define PPSI_T1CK	    (uint8_t*)&RPINR2+1  ///< Timer1 External Clock
#define PPSI_TCKI1	    (uint8_t*)&RPINR3    ///< SCCP Timer1
#define PPSI_ICM1	    (uint8_t*)&RPINR3+1  ///< SCCP Capture 1
#define PPSI_TCKI2	    (uint8_t*)&RPINR4    ///< SCCP Timer2
#define PPSI_ICM2	    (uint8_t*)&RPINR4+1  ///< SCCP Capture 2
#define PPSI_TCKI3	    (uint8_t*)&RPINR5    ///< SCCP Timer3
#define PPSI_ICM3	    (uint8_t*)&RPINR5+1  ///< SCCP Capture 3
#define PPSI_TCKI4	    (uint8_t*)&RPINR6    ///< SCCP Timer4
#define PPSI_ICM4	    (uint8_t*)&RPINR6+1  ///< SCCP Capture 4
// ------------------------------------------------------------------
#if defined (__P33SMPS_CK__) || defined (__P33SMPS_CHM__)
// Ara, Sagitta, Sagitta++ and Gemini/Sagittarius main core devices only

  #define PPSI_TCKI5	(uint8_t*)&RPINR7    ///< SCCP/MCCP Timer5
  #define PPSI_ICM5     (uint8_t*)&RPINR7+1  ///< SCCP/MCCP Capture 5

#endif
#if defined (__P33SMPS_SAGITTA__) || defined (__P33SMPS_SAGITTAP__) || \
    defined (__P33SMPS_SAGITTAPP__) || defined (__P33SMPS_CHM__) || \
    defined (__P33SMPS_OCTANSP__)
// Sagitta, Sagitta++, Octans+ and Gemini/Sagittarius main core devices only

  #define PPSI_TCKI6	(uint8_t*)&RPINR8    ///< SCCP Timer6
  #define PPSI_ICM6     (uint8_t*)&RPINR8+1  ///< SCCP Capture 6
  #define PPSI_TCKI7	(uint8_t*)&RPINR9    ///< SCCP Timer7
  #define PPSI_ICM7     (uint8_t*)&RPINR9+1  ///< SCCP Capture 7
  #define PPSI_TCKI8	(uint8_t*)&RPINR10   ///< SCCP Timer8
  #define PPSI_ICM8     (uint8_t*)&RPINR10+1 ///< SCCP Capture 8

#endif
// ------------------------------------------------------------------
#define PPSI_OCFA	    (uint8_t*)&RPINR11   ///< xCCP Fault A
#define PPSI_OCFB	    (uint8_t*)&RPINR11+1 ///< xCCP Fault B
#define PPSI_PCI8	    (uint8_t*)&RPINR12   ///< PWM PCI 8
#define PPSI_PCI9	    (uint8_t*)&RPINR12+1 ///< PWM PCI 9
#define PPSI_PCI10	    (uint8_t*)&RPINR13   ///< PWM PCI 10
#define PPSI_PCI11	    (uint8_t*)&RPINR13+1 ///< PWM PCI 11
#define PPSI_QEIA1	    (uint8_t*)&RPINR14   ///< QEI1 Input A
#define PPSI_QEIB1	    (uint8_t*)&RPINR14+1 ///< QEI1 Input B
#define PPSI_QEINDX1    (uint8_t*)&RPINR15   ///< QEI1 Index 1
#define PPSI_QEIHOM1    (uint8_t*)&RPINR15+1 ///< QEI1 Home	1
// ------------------------------------------------------------------
#if defined (__P33SMPS_CK__)
// Ara, Sagitta and Sagitta++ devices only

  #define PPSI_QEIA2	(uint8_t*)&RPINR16   ///< QEI2 Input A
  #define PPSI_QEIB2	(uint8_t*)&RPINR16+1 ///< QEI2 Input B
  #define PPSI_QEINDX2  (uint8_t*)&RPINR17   ///< QEI2 Index 1
  #define PPSI_QEIHOM2  (uint8_t*)&RPINR17+1 ///< QEI2 Home 1

#endif
// ------------------------------------------------------------------
#define PPSI_U1RX	    (uint8_t*)&RPINR18   ///< UART1 Receive
#define PPSI_U1DSR	    (uint8_t*)&RPINR18+1 ///< UART1 Data-Set Ready
// ------------------------------------------------------------------
#if defined (__P33SMPS_CK__) || defined (__P33SMPS_CHM__)
// Ara, Sagitta, Sagitta++ and Gemini/Sagittarius main core devices only

  #define PPSI_U2RX     (uint8_t*)&RPINR19   ///< UART2 Receive
  #define PPSI_U2DSR    (uint8_t*)&RPINR19+1 ///< UART2 Data-Set-Ready

#endif
// ------------------------------------------------------------------
#define PPSI_SDI1	    (uint8_t*)&RPINR20   ///< SPI1 Data Input
#define PPSI_SCK1IN     (uint8_t*)&RPINR20+1 ///< SPI1 Clock Input
#define PPSI_SS1        (uint8_t*)&RPINR21   ///< SPI1 Slave Select
#define PPSI_REFOI	    (uint8_t*)&RPINR21+1 ///< Reference Clock Input
// ------------------------------------------------------------------
#if defined (__P33SMPS_CK__) || defined (__P33SMPS_CHM__)
// Ara, Sagitta, Sagitta++ and Gemini/Sagittarius main core devices only

  #define PPSI_SDI2     (uint8_t*)&RPINR22   ///< SPI2 Data Input
  #define PPSI_SCK2IN   (uint8_t*)&RPINR22+1 ///< SPI2 Clock Input
  #define PPSI_SS2      (uint8_t*)&RPINR23   ///< SPI2 Slave Select

#endif
#if defined (__P33SMPS_CH__)
// Gemini/Sagittarius devices only

  #define PPSI_U1CTS   (uint8_t*)&RPINR23+1 ///< UART1 Clear To Send

#endif
#if defined (__P33SMPS_SAGITTAP__) || defined (__P33SMPS_SAGITTAPP__)
// Sagitta+ and Sagitta++ devices only

  #define PPSI_QEIA3	(uint8_t*)&RPINR24   ///< QEI3 Input A
  #define PPSI_QEIB3	(uint8_t*)&RPINR24+1 ///< QEI3 Input B
  #define PPSI_QEINDX3  (uint8_t*)&RPINR25   ///< QEI3 Index 1
  #define PPSI_QEIHOM3  (uint8_t*)&RPINR25+1 ///< QEI3 Home 1

#endif
#if defined (__P33SMPS_CK5__) || defined (__P33SMPS_CK6__) || \
    defined (__P33SMPS_CK7__) || defined (__P33SMPS_CHM__)
// Sagitta, Sagitta+, Sagitta++ and Gemini/Sagittarius main core devices with CAN FD interface only

  #define PPSI_CAN1RX   (uint8_t*)&RPINR26   ///< CAN1 Input

#endif
#if defined (__P33SMPS_CK5__) || defined (__P33SMPS_CK6__) || \
    defined (__P33SMPS_CK7__) || defined (__P33SMPS_CHEM__)
// Sagitta, Sagitta+, Sagitta++ and Sagittarius main core devices with CAN FD interface only

