areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_pps-d.h
  #define PPSI_CAN2RX   (uint8_t*)&RPINR26+1 ///< CAN2 Input

#endif
#if defined (__P33SMPS_CK__)
//Ara, Sagitta and Sagitta++ devices only

  #define PPSI_U3RX     (uint8_t*)&RPINR27   ///< UART3 Receive
  #define PPSI_U3DSR    (uint8_t*)&RPINR27+1 ///< UART3 Data-Set-Ready
  #define PPSI_SDI3     (uint8_t*)&RPINR29   ///< SPI3 Data Input
  #define PPSI_SCK3IN   (uint8_t*)&RPINR29+1 ///< SPI3 Clock Input
  #define PPSI_SS3      (uint8_t*)&RPINR30   ///< SPI3 Slave Select

#endif
#if defined (__P33SMPS_CHM__)
// Gemini and Sagittarius main core devices only

  #define PPSI_U2CTS	(uint8_t*)&RPINR30   ///< UART2 Clear-to-Send

#endif
#if defined (__P33SMPS_SAGITTAPP__)
// Sagitta++ devices only

  #define PPSI_CLCINE   (uint8_t*)&RPINR30+1 ///< CLC Input E
  #define PPSI_CLCINF   (uint8_t*)&RPINR31   ///< CLC Input F
  #define PPSI_CLCING   (uint8_t*)&RPINR31+1 ///< CLC Input G
  #define PPSI_CLCINH   (uint8_t*)&RPINR32   ///< CLC Input H

#endif
#if defined (__P33SMPS_SAGITTA__) || defined (__P33SMPS_SAGITTAP__) || defined (__P33SMPS_SAGITTAPP__)
// Sagitta, Sagitta+ and Sagitta++ devices only

  #define PPSI_TCKI9    (uint8_t*)&RPINR32+1 ///< MCCP Timer9
  #define PPSI_ICM9     (uint8_t*)&RPINR33   ///< MCCP Capture 9

#endif
#if defined (__P33SMPS_CK__)
// Ara, Sagitta and Sagitta++ devices only

  #define PPSI_OCFC     (uint8_t*)&RPINR37   ///< xCCP Fault C

#endif
// ------------------------------------------------------------------
#define PPSI_PCI17      (uint8_t*)&RPINR37+1 ///< PWM Input 17
#define PPSI_PCI18      (uint8_t*)&RPINR38   ///< PWM Input 18
#define PPSI_PCI12      (uint8_t*)&RPINR42   ///< PWM Input 12
#define PPSI_PCI13      (uint8_t*)&RPINR42+1 ///< PWM Input 13
#define PPSI_PCI14      (uint8_t*)&RPINR43   ///< PWM Input 14
#define PPSI_PCI15      (uint8_t*)&RPINR43+1 ///< PWM Input 15
#define PPSI_PCI16      (uint8_t*)&RPINR44   ///< PWM Input 16
// ------------------------------------------------------------------
#if defined (__P33SMPS_CK__) || defined (__P33CSMPS_CH_MAIN__)
// Ara, Sagitta, Sagitta++ and Gemini/Sagittarius main core devices only

  #define PPSI_SENT1    (uint8_t*)&RPINR44+1 ///< SENT1 Input
  #define PPSI_SENT2    (uint8_t*)&RPINR45   ///< SENT2 Input

#endif
// ------------------------------------------------------------------
#define PPSI_CLCINA     (uint8_t*)&RPINR45+1 ///< CLC Input A
#define PPSI_CLCINB     (uint8_t*)&RPINR46   ///< CLC Input B
#define PPSI_CLCINC     (uint8_t*)&RPINR46+1 ///< CLC Input C
#define PPSI_CLCIND     (uint8_t*)&RPINR47   ///< CLC Input D
#define PPSI_ADCTRG     (uint8_t*)&RPINR47+1 ///< ADC Trigger Input (ADTRIG31)
// ------------------------------------------------------------------
#if defined (__P33SMPS_CK__)
// Ara, Sagitta and Sagitta++ devices only

  #define PPSI_OCFD     (uint8_t*)&RPINR48   ///< xCCP Fault D
  #define PPSI_U1CTS    (uint8_t*)&RPINR48+1 ///< UART1 Clear-to-Send
  #define PPSI_U2CTS    (uint8_t*)&RPINR49   ///< UART2 Clear-to-Send
  #define PPSI_U3CTS    (uint8_t*)&RPINR49+1 ///< UART3 Clear-to-Send

#endif
/** @} */ // end of p33c-pral-pps-constants-inreg


/*********************************************************************************
 * @addtogroup p33c-pral-pps-constants-output
 * @{
 * @details
 * Peripheral Pin Select Output Sources specify the peripheral
 * function IDs used to map an output function to a specific
 * device RP output pin. A device-specific collection of peripheral
 * function IDs is provided by macros. These macros are also made
 * available by enumeration PPSO_FUNCTIONS_e, easing the use to the
 * API functions.
 *
 * <p><b>Example</b></p>
 *  UART1 Transmit output should be assigned as device pin RC3.
 *  The output pin configuration register location of pin RC3
 *  (RP51) is the high-byte of register RPOR9. This memory address
 *  can be accessed using the default macro _RP51R for pin RP51.
 *  The peripheral function ID of UART1 TxD is 0x01.
 *
 * <b><u>Example 1</u></b>
 *  shows the direct register access method, where the peripheral
 *  function ID is directly written to the RPORx register location
 *  of the desired the device RP pin index:
 *
 * @code {.c}
 *
 *  _RP51R = PPSO_U1TX; // Assign UART1 TX to pin RP51 (Example 1)
 *
 * @endcode
 *
 * <b><u>Example 2</u></b>
 *  shows the usage of the p33c_pps API function, where the
 *  peripheral function ID is written to the RPORx register
 *  location of the desired the device RP pin index by calling
 *  function p33c_PPS_MapOutput(x, y):
 *
 * @code {.c}
 *
 *  p33c_PPS_MapInput(51, PPSO_U1TX); // Assign UART1 TX pin RP51 to (Example 2)
 *
 * @endcode
 *
 * @note
 * Not all peripheral functions are available on all devices and the list
 * captured in this documentation may not be complete. Please review
 * the target device data sheet as well as the header file code for more
 * information.
 ********************************************************************************/

// ------------------------------------------------------------------
#define PPSO_DEFAULT    (uint8_t)0b00000000 ///< RPn tied to VSS
#define PPSO_NULL       (uint8_t)0b00000000 ///< RPn tied to VSS
#define PPSO_NONE       (uint8_t)0b00000000 ///< RPn tied to VSS
// ------------------------------------------------------------------
#define PPSO_VSS        (uint8_t)0b00000000 ///< RPn tied to VSS
#define PPSO_U1TX       (uint8_t)0b00000001 ///< RPn tied to UART1 Transmit
#define PPSO_U1RTS      (uint8_t)0b00000010 ///< RPn tied to UART1 Request-to-Send
// ------------------------------------------------------------------
#if defined (__P33SMPS_CK__) || defined (__P33SMPS_CHM__)
// Ara, Sagitta and Sagitta++ and Gemini/Sagittarius main core devices only

  #define PPSO_U2TX     (uint8_t)0b00000011 ///< RPn tied to UART2 Transmit
  #define PPSO_U2RTS    (uint8_t)0b00000100 ///< RPn tied to UART2 Request-to-Send

#endif
// ------------------------------------------------------------------
#define PPSO_SDO1       (uint8_t)0b00000101 ///< RPn tied to SPI1 Data Output
#define PPSO_SCK1       (uint8_t)0b00000110 ///< RPn tied to SPI1 Clock Output
#define PPSO_SS1        (uint8_t)0b00000111 ///< RPn tied to SPI1 Slave Select
// ------------------------------------------------------------------
#if defined (__P33SMPS_CK__) || defined (__P33SMPS_CHM__)

  #define PPSO_SDO2     (uint8_t)0b00001000 ///< RPn tied to SPI2 Data Output
  #define PPSO_SCK2     (uint8_t)0b00001001 ///< RPn tied to SPI2 Clock Output
  #define PPSO_SS2      (uint8_t)0b00001010 ///< RPn tied to SPI2 Slave Select

#endif
#if defined (__P33SMPS_CK__)
    // Ara, Sagitta and Sagitta++ and Gemini/Sagittarius main core devices only

  #define PPSO_SDO3     (uint8_t)0b00001011 ///< RPn tied to SPI3 Data Output
  #define PPSO_SCK3     (uint8_t)0b00001100 ///< RPn tied to SPI3 Clock Output
  #define PPSO_SS3      (uint8_t)0b00001101 ///< RPn tied to SPI3 Slave Select

#endif
// ------------------------------------------------------------------
#define PPSO_REFCLKO    (uint8_t)0b00001110 ///< RPn tied to Reference Clock Output
#define PPSO_OCM1       (uint8_t)0b00001111 ///< RPn tied to SCCP1 Output
#define PPSO_OCM2       (uint8_t)0b00010000 ///< RPn tied to SCCP2 Output
#define PPSO_OCM3       (uint8_t)0b00010001 ///< RPn tied to SCCP3 Output
#define PPSO_OCM4       (uint8_t)0b00010010 ///< RPn tied to SCCP4 Output
// ------------------------------------------------------------------
#if defined (__P33SMPS_SAGITTA__) || defined (__P33SMPS_SAGITTAPP__) || \
    defined (__P33SMPS_SAGITTAPP__) || defined (__P33SMPS_CHM__)
// Sagitta, Sagitta+, Sagitta++ and Gemini/Sagittarius main core devices only

