areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_pps-d.h
  #define PPSO_OCM5     (uint8_t)0b00010011 ///< RPn tied to SCCP5 Output
  #define PPSO_OCM6     (uint8_t)0b00010100 ///< RPn tied to SCCP6 Output

#endif
#if defined (__P33SMPS_CK5__) || defined (__P33SMPS_CK6__) || \
    defined (__P33SMPS_CK7__) || defined (__P33SMPS_CH5__)
// Sagitta, Sagitta+, Sagitta++ and Gemini/Sagittarius main core devices only

  #define PPSO_CAN1     (uint8_t)0b00010101 ///< RPn tied to CAN1 Output

#endif
#if defined (__P33SMPS_CK5__) || defined (__P33SMPS_CK6__) || defined (__P33SMPS_CK7__) || \
    (defined (__P33SMPS_CH5__) && defined (__P33SMPS_CHE__))
// Sagitta, Sagitta+, Sagitta++ and Sagittarius main core devices only

  #define PPSO_CAN2     (uint8_t)0b00010110 ///< RPn tied to CAN2 Output

#endif
// ------------------------------------------------------------------
#define PPSO_CMP1       (uint8_t)0b00010111 ///< RPn tied to Comparator 1 Output
// ------------------------------------------------------------------
#if defined (__P33SMPS_CK__) || defined (__P33SMPS_CHS__)
// Ara, Sagitta, Sagitta+, Sagitta++ and Gemini/Sagittarius secondary core devices only

  #define PPSO_CMP2     (uint8_t)0b00011000 ///< RPn tied to Comparator 2 Output
  #define PPSO_CMP3     (uint8_t)0b00011001 ///< RPn tied to Comparator 3 Output

#endif
#if defined (__P33SMPS_SAGITTAP__) || defined (__P33SMPS_SAGITTAPP__)
// Sagitta+ and Sagitta++ only
  #define PPSO_CMP4     (uint8_t)0b00011010 ///< RPn tied to Comparator 4 Output

#endif
#if defined (__P33SMPS_CK__)
// Ara, Sagitta and Sagitta++ devices only

  #define PPSO_U3TX     (uint8_t)0b00011011 ///< RPn tied to UART3 Transmit
  #define PPSO_U3RTS    (uint8_t)0b00011100 ///< RPn tied to UART3 Request-to-Send

#endif
#if defined (__P33SMPS_SAGITTAP__) || defined (__P33SMPS_SAGITTAPP__)
// Sagitta+ and Sagitta++ only
  #define PPSO_PWMEE    (uint8_t)0b00011011 ///< RPn tied to UART3 Transmit
  #define PPSO_PWMEF    (uint8_t)0b00011100 ///< RPn tied to UART3 Request-to-Send
  #define PPSO_CMP5     (uint8_t)0b00100000 ///< RPn tied to Comparator 5 Output
  #define PPSO_CMP6     (uint8_t)0b00100001 ///< RPn tied to Comparator 6 Output
#endif
// ------------------------------------------------------------------
#define PPSO_PWM4H      (uint8_t)0b00100010 ///< RPn tied to PWM4H Output
#define PPSO_PWM4L      (uint8_t)0b00100011 ///< RPn tied to PWM4L Output
#define PPSO_PWMEA      (uint8_t)0b00100100 ///< RPn tied to PWM Event A Output
#define PPSO_PWMEB      (uint8_t)0b00100101 ///< RPn tied to PWM Event B Output
#define PPSO_QEICMP1    (uint8_t)0b00100110 ///< RPn tied to QEI1 Comparator Output
// ------------------------------------------------------------------
#if defined (__P33SMPS_ARA__) || defined (__P33SMPS_SAGITTA__) || defined (__P33SMPS_SAGITTAPP__)
// Ara, Sagitta, Sagitta+ and Sagitta++ devices only
  #define PPSO_QEICMP2  (uint8_t)0b100111  ///< RPn tied to QEI2 Comparator Output
#endif
// ------------------------------------------------------------------
#define PPSO_CLC1OUT    (uint8_t)0b00101000 ///< RPn tied to CLC1 Output
#define PPSO_CLC2OUT    (uint8_t)0b00101001 ///< RPn tied to CLC2 Output
// ------------------------------------------------------------------
#if defined (__P33SMPS_SAGITTA__) || defined (__P33SMPS_SAGITTAP__) || \
    defined (__P33SMPS_SAGITTAPP__) || defined (__P33SMPS_CHM__)
// Sagitta, Sagitta+, Sagitta++ and Gemini/Sagittarius main core devices only

  #define PPSO_OCM7     (uint8_t)0b00101010 ///< RPn tied to SCCP7 Output
  #define PPSO_OCM8     (uint8_t)0b00101011 ///< RPn tied to SCCP8 Output

#endif
// ------------------------------------------------------------------
#define PPSO_PWMEC      (uint8_t)0b00101100 ///< RPn tied to PWM Event C Output
#define PPSO_PWMED      (uint8_t)0b00101101 ///< RPn tied to PWM Event D Output
#define PPSO_PTGTRG24   (uint8_t)0b00101110 ///< PTG Trigger Output 24
#define PPSO_PTGTRG25   (uint8_t)0b00101111 ///< PTG Trigger Output 25
// ------------------------------------------------------------------
#if defined (__P33SMPS_SAGITTA__) || defined (__P33SMPS_SAGITTAP__) || \
    defined (__P33SMPS_SAGITTAPP__) || defined (__P33SMPS_CHM__)
// Sagitta, Sagitta+, Sagitta++ and Gemini/Sagittarius main core devices only

  #define PPSO_SENT1OUT (uint8_t)0b00110000 ///< RPn tied to SENT1 Output
  #define PPSO_SENT2OUT (uint8_t)0b00110001 ///< RPn tied to SENT2 Output

#endif
#if defined (__P33SMPS_CK1__)
// Ara devices only

  #define PPSO_OCM5A    (uint8_t)0b00110010 ///< RPn tied to SCCP/MCCP5 Output A
  #define PPSO_OCM5B    (uint8_t)0b00110011 ///< RPn tied to SCCP/MCCP5 Output B
  #define PPSO_OCM5C    (uint8_t)0b00110100 ///< RPn tied to SCCP/MCCP5 Output C
  #define PPSO_OCM5D    (uint8_t)0b00110101 ///< RPn tied to SCCP/MCCP5 Output D
  #define PPSO_OCM5E    (uint8_t)0b00110110 ///< RPn tied to SCCP/MCCP5 Output E
  #define PPSO_OCM5F    (uint8_t)0b00110111 ///< RPn tied to SCCP/MCCP5 Output F

#elif defined (__P33SMPS_SAGITTA__) || defined (__P33SMPS_SAGITTAPP__)
// Sagitta and Sagitta++ devices only

  #define PPSO_OCM9A    (uint8_t)0b00110010 ///< RPn tied to SCCP/MCCP9 Output A
  #define PPSO_OCM9B    (uint8_t)0b00110011 ///< RPn tied to SCCP/MCCP9 Output B
  #define PPSO_OCM9C    (uint8_t)0b00110100 ///< RPn tied to SCCP/MCCP9 Output C
  #define PPSO_OCM9D    (uint8_t)0b00110101 ///< RPn tied to SCCP/MCCP9 Output D
  #define PPSO_OCM9E    (uint8_t)0b00110110 ///< RPn tied to SCCP/MCCP9 Output E
  #define PPSO_OCM9F    (uint8_t)0b00110111 ///< RPn tied to SCCP/MCCP9 Output F

#endif
#if defined (__P33SMPS_SAGITTAPP__)
// Sagitta++ only

  #define PPSO_APWMEE   (uint8_t)0b00111000  ///< RPn tied to APWM Event E Output
  #define PPSO_APWMEF   (uint8_t)0b00111001  ///< RPn tied to APWM Event F Output
  #define PPSO_QEICMP3  (uint8_t)0b00111010  ///< RPn tied to QEI3 Comparator Output

#endif
#if defined (__P33SMPS_SAGITTAP__) || defined (__P33SMPS_CH__)
// Sagitta+ and Gemini/Sagittarius mains and secondary core devices only

  #define PPSO_CLC3OUT  (uint8_t)0b00110010 ///< RPn tied to CLC3 Output
  #if defined (__P33SMPS_SAGITTAP__) || defined (__P33SMPS_CHM__)
  #define PPSO_CLC4OUT  (uint8_t)0b00110011 ///< RPn tied to CLC4 Output
  #define PPSO_U1DTR    (uint8_t)0b00110100  ///< RPn tied to Data Terminal Ready Output 1
  #define PPSO_U2DTR    (uint8_t)0b00110101  ///< RPn tied to Data Terminal Ready Output 2
  #endif

#elif defined (__P33SMPS_ARA__) || defined (__P33SMPS_SAGITTA__) || defined (__P33SMPS_SAGITTAPP__)
// Ara, Sagitta and Sagitta++ devices only

  #define PPSO_CLC3OUT  (uint8_t)0b00111011 ///< RPn tied to CLC3 Output
  #define PPSO_CLC4OUT  (uint8_t)0b00111100 ///< RPn tied to CLC4 Output
  #define PPSO_U1DTR    (uint8_t)0b00111101 ///< RPn tied to Data Terminal Ready Output 1
  #define PPSO_U2DTR    (uint8_t)0b00111110 ///< RPn tied to Data Terminal Ready Output 2
  #define PPSO_U3DTR    (uint8_t)0b00111111 ///< RPn tied to Data Terminal Ready Output 3

#endif

#if defined (__P33SMPS_SAGITTAPP__)
// Sagitta++ devices only

  #define PPSO_APWMEA   (uint8_t)0b01000000 ///< RPn tied to APWM Event A Output
  #define PPSO_APWMEB   (uint8_t)0b01000001 ///< RPn tied to APWM Event B Output
  #define PPSO_APWMEC   (uint8_t)0b01000010 ///< RPn tied to APWM Event C Output
  #define PPSO_APWMED   (uint8_t)0b01000011 ///< RPn tied to APWM Event D Output
  #define PPSO_CLC5OUT  (uint8_t)0b01000100 ///< RPn tied to CLC5 Output
  #define PPSO_CLC6OUT  (uint8_t)0b01000101 ///< RPn tied to CLC6 Output
  #define PPSO_CLC7OUT  (uint8_t)0b01000110 ///< RPn tied to CLC7 Output
  #define PPSO_CLC8OUT  (uint8_t)0b01000111 ///< RPn tied to CLC8 Output

#endif
/** @} */ // end of p33c-pral-pps-constants-outreg

#endif // End of P33C_PPS_SFR_DECLARATIONS_H

// ___________________________
// end of file
